# Dataframes Handling

**Inhalt:** Ein bessere Gefühl dafür erhalten, wie Dataframes aufgebaut sind und wie man damit umgeht

**Nötige Skills:** Erste Schritte mit Pandas

**Lernziele:**
- Verschiedene Konstruktur-Methoden für Dataframes kennenlernen
- Wie Series und Dataframes zusammenspielen
- Der Index und verschiedene Arten, ihn zu referenzieren
- Spalten und Zeilen hinzufügen und löschen
- Aufmerksamkeit schärfen für Dinge wie `inplace=True`

## Vorbereitung

In [47]:
import pandas as pd

## Dataframes konstruieren

Man kann Daten nicht nur aus Dateien in ein Dataframe laden, sondern auch aus anderen Datenstrukturen. Es gibt gefühlt 1000 Arten, ein Dataframe zu konstruieren.

Einige Beispiele dazu finden sich hier: https://pandas.pydata.org/pandas-docs/stable/dsintro.html

Eine Referenz zur Funktion `DataFrame()` findet sich hier: https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html. An diesem Ort sind übrigens auch alle Methoden verzeichnet, die auf DataFrame-Objekte angewandt werden können.

Wir schauen uns hier eine kleine Auswahl davon an.

### Dataframe aus Dictionaries erstellen

Daten können aus verschiedenen Quellen kommen. Aus Dateien, oder zB auch von gescrapten Webseiten.

Nehmen wir mal an, wir haben Daten von einer Social Media Seite zusammengestellt, und sie liegen nun Form von Dictionaries vor.

Wie können wir damit in Pandas arbeiten?

In [48]:
person1 = {'Name': 'Peter', 'Groesse': 180, 'Alter': 30}
person2 = {'Name': 'Paul', 'Groesse': 176, 'Alter': 44}
person3 = {'Name': 'Maria', 'Groesse': 165, 'Alter': 25}
person1

{'Name': 'Peter', 'Groesse': 180, 'Alter': 30}

Schritt 1: Wir machen daraus eine "Liste von Dictionaries":

In [50]:
l = [person1, person2, person3]
l

[{'Name': 'Peter', 'Groesse': 180, 'Alter': 30},
 {'Name': 'Paul', 'Groesse': 176, 'Alter': 44},
 {'Name': 'Maria', 'Groesse': 165, 'Alter': 25}]

Schritt 2: Wir machen aus der Liste ein Dataframe:

In [51]:
df = pd.DataFrame(l)

Die einzelnen Einträge in der Liste sind nun die *Zeilen* in der Tabelle:

In [52]:
df

    Name  Groesse  Alter
0  Peter      180     30
1   Paul      176     44
2  Maria      165     25

### Dataframe aus Listen erstellen

Vielleicht sind wir aber auch auf anderem Weg an diese Daten gekommen.

Und wir haben nun eine Liste von Personen sowie von deren Attributen, statt ein Dictionary.

In [53]:
namen = ['Peter', 'Paul', 'Maria']
groesse = [180, 176, 165]
alter = [30, 44, 25]
noten = [5,5,4]

Schritt 1: Wir machen ein "Dictionary von Listen" daraus.

In [55]:
d = {'Name': namen, 'Groesse': groesse, 'Alter': alter, "Noten": noten}
d

{'Name': ['Peter', 'Paul', 'Maria'],
 'Groesse': [180, 176, 165],
 'Alter': [30, 44, 25],
 'Noten': [5, 5, 4]}

Schritt 2: Wir machen aus dem Dictionary ein Dataframe

In [60]:
df = pd.DataFrame(d)

Die einzelnen Einträge im Dictionary sind nun die *Spalten* in unserer Tabelle:

In [61]:
df

    Name  Groesse  Alter  Noten
0  Peter      180     30      5
1   Paul      176     44      5
2  Maria      165     25      4

**Note:** Wichtig ist nicht unbedingt, diese Techniken auswendig zu können. Sondern einfach zu wissen: `DataFrame()` ist eine sehr vielseitige Funktion, man kann fast alles darin reinfüttern.

Falls das Resultat nicht so herauskommt, wie gewünscht, ist die Chance gross, dass sich eine andere Variante findet, wie man aus irgendwelchen Datenstrukturen ein Dataframe erhält. Es gibt zB auch:

- pd.DataFrame.from_dict()
- pd.DataFrame.from_records()
- pd.DataFrame.from_items()

Im Zweifelsfall: Dokumentation konsultieren, Beispiele anschauen, ausprobieren!

Dataframes kann man auch aus Serien generieren.

### Serien

Was sind schon wieder Serien? Ach ja: Es ist das, was herauskommt, wenn man einzelne Spalten eines Dataframes herauszieht.

In [66]:
a = 1.0
type(a)

float

In [68]:
type(df['Name'])

pandas.core.series.Series

Serien sind ganz einfach gesagt eine Art von indexierten Listen.

Wir kann sie ähnlich wie Dataframes auch from Scratch konstruieren – mittels `pd.Series()`

In [69]:
s = pd.Series(['Peter', 'Paul', 'Maria'])
s

0    Peter
1     Paul
2    Maria
dtype: object

Der Index muss übrigens nicht zwingend aus einer Zahlenreihe bestehen.

In [70]:
s = pd.Series(['Peter', 'Paul', 'Maria'], index=['a', 'b', 'c'])
s

a    Peter
b     Paul
c    Maria
dtype: object

Series sind ähnlich wie Listen, aber auch ähnlich wie Dictionaries. Man kann basierend auf dem Index zB einzelne Elemente aufrufen

In [71]:
s['a']

'Peter'

... oder auch andere, lustige Auswahloperationen machen

In [77]:
a = [1,2,3,4,5,6]
a[:3]

[1, 2, 3]

In [78]:
s['b':]

b     Paul
c    Maria
dtype: object

Eine Reihe von Serien zu einem Dataframe zusammenzufügen, funktioniert sehr ähnlich wie mit Listen.

### Dataframe aus Series erstellen

Nehmen wir also an, unsere Daten liegen in Form von Listen vor:

In [79]:
s_name = pd.Series(['Peter', 'Paul', 'Maria'])
s_groesse= pd.Series([180, 176, 165])
s_alter= pd.Series([30, 44, 25])

In [80]:
s_name

0    Peter
1     Paul
2    Maria
dtype: object

In [81]:
s_groesse

0    180
1    176
2    165
dtype: int64

In [82]:
s_alter

0    30
1    44
2    25
dtype: int64

Um die drei Serien zu einem Dataframe zu machen, gehen wir ähnlich vor wie zuvor.

Schirtt 1: Wir basteln einen Dictionary aus den Serien:

In [83]:
d = {"Name": s_name, "Groesse": s_groesse, "Alter": s_alter}
d

{'Name': 0    Peter
 1     Paul
 2    Maria
 dtype: object,
 'Groesse': 0    180
 1    176
 2    165
 dtype: int64,
 'Alter': 0    30
 1    44
 2    25
 dtype: int64}

Schritt 2: Wir kontstruieren aus dem Dictionary ein Dataframe

In [92]:
tmp = pd.DataFrame(d)
tmp

    Name  Groesse  Alter
0  Peter      180     30
1   Paul      176     44
2  Maria      165     25

In [93]:
tmp["Alter"]

0    30
1    44
2    25
Name: Alter, dtype: int64

### Dataframes aus mühsamen Strukturen erstellen

Nehmen wir mal an, unsere Daten liegen in einer etwas merkwürdigen Form vor (merkwürdig zB deshalb, weil man normalerweise den Inhalt eines Datenfeldes ("Peter") nicht als Variablennamen verwenden würde):

In [85]:
Peter = {'Groesse': 180, 'Alter': 30}
Paul = {'Groesse': 176, 'Alter': 44}
Maria = {'Groesse': 165, 'Alter': 25}

In [88]:
Peter["Alter"]

30

Eine Variante, um ein Dataframe zu erstellen, könnte so funktionieren:

In [89]:
df = pd.DataFrame([Peter, Paul, Maria], index=['Peter', 'Paul', 'Maria'])
df

       Groesse  Alter
Peter      180     30
Paul       176     44
Maria      165     25

Wir haben nun eine etwas anders aufgebaute Tabelle. Die Index-Spalte besteht nicht mehr aus Zahlen, sondern aus den Werten in einer bestimmten Spalte.

Wir schauen uns nun die Index-Spalte etwas genauer an.

### Mit dem Index arbeiten

Wir haben bereits kennengelernt, wie man die Werte einer einzelnen Spalte herausziehen kann:

In [95]:
df['Groesse']

Peter    180
Paul     176
Maria    165
Name: Groesse, dtype: int64

Mit einzelnen Zeilen funktioniert es ähnlich, allerdings brauchen wir dazu noch eine spezielle Syntax: `df.loc[]`

In [96]:
df.loc['Peter']

Groesse    180
Alter       30
Name: Peter, dtype: int64

`df.loc['Peter']` funktioniert, weil es eine Zeile gibt, die den Indexwert "Peter" hat.

Falls nötig, können wir eine bestimmte Zeile aber auch jederzeit mit einem Integer-Zahlenwert referenzieren.

Dafür gibt es die Syntax `df.iloc[]` - die Zählung startet bei null, nicht bei eins.

In [103]:
df.iloc[0]

Groesse    180
Alter       30
Name: Peter, dtype: int64

Wollen wir nur bestimmte Spaltenwerte anzeigen, funktioniert das so:

In [102]:
df.loc['Peter', 'Alter']

30

Diese Syntax dient übrigens auch dazu, Werte zu überschreiben:

In [104]:
df.loc['Peter', 'Alter'] = 60

Peter ist nun nicht mehr 30, sondern 60 Jahre alt.

In [105]:
df

       Groesse  Alter
Peter      180     60
Paul       176     44
Maria      165     25

**Achtung:** Das hier funktioniert übrigens nicht: (Warum nicht?)

In [113]:
df[df['Alter'] == 60]['Alter'] = 30

<ipython-input-113-886bef33d16c>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[df['Alter'] == 60]['Alter'] = 30

In [114]:
df

       Groesse  Alter
Peter      180     60
Paul       176     44
Maria      165     25

Im allgemeinen ist es allerdings unschön, bestimmte Datenfelder als Index zu verwenden - könnte ja sein, dass zwei Leute Peter heissen, das gäbe an irgendeinem Punkt ziemlich sicher einen Fehler.

Um das zu ändern, gibt es eine einfache Funktion: `reset_index()`

Nun haben wir einen neuen Index (**fett**), und die Namen wurden in eine separate Spalte kopiert.

In [115]:
df = df.reset_index()
df

   index  Groesse  Alter
0  Peter      180     60
1   Paul      176     44
2  Maria      165     25

Das Problem ist, die Spalte mit den Namen heisst jetzt "index"...

Um das zu ändern, benutzen wir `df.rename()` und geben einen Dictionary mit auf den Weg, der die zu ändernden Spaltennamen beinhaltet.

In [143]:
df = df.rename(columns={"index": "Name"})

In [144]:
df

    Name  Height  Alter  Groesse
0  Peter   180.0     60      NaN
1   Paul     NaN     44    176.0

**Achtung:** Wie die meisten Funktionen bei Pandas, ändert `df.rename()` nicht das Dataframe selbst, sondern spuckt ein neues Dataframe aus.

Um die Änderung zu speichern, haben wir zwei Optionen:

a) Wir speichern das retournierte Dataframe unter demselben oder unter einem neuen Namen (`df2`) ab:

In [145]:
df_2 = df.rename(columns={'index': 'Name'})
df_2

    Name  Height  Alter  Groesse
0  Peter   180.0     60      NaN
1   Paul     NaN     44    176.0

b) Wir verwenden das Argument `inplace=True`, das so viel bedeutet wie: "mach das gleich an Ort und Stelle".

In [146]:
df.rename(columns={'index': 'Name'}, inplace=True)
df

    Name  Height  Alter  Groesse
0  Peter   180.0     60      NaN
1   Paul     NaN     44    176.0

`inplace=True` funktioniert übrigens auch mit einigen anderen Funktionen, z.B. auch mit `df.reset_index()`

In [147]:
df.reset_index(inplace=True)

In [148]:
df

   index   Name  Height  Alter  Groesse
0      0  Peter   180.0     60      NaN
1      1   Paul     NaN     44    176.0

Oops! Nun haben wir bereits eine Spalte zu viel drin, die wir gar nicht wollen.

Macht nix, wir werfen sie einfach wieder raus. Und zwar mit `pop()`

In [149]:
a = [1,2,3,4,5]
a.pop(0)
a

[2, 3, 4, 5]

In [150]:
df.pop('index')

0    0
1    1
Name: index, dtype: int64

In [151]:
df

    Name  Height  Alter  Groesse
0  Peter   180.0     60      NaN
1   Paul     NaN     44    176.0

**Note:** Anders als zuvor hat `df.pop()` gleich an Ort und Stelle die Spalte rausgeworfen, statt ein neues Dataframe auszuspucken. Das Default-Verhalten ist über Pandas hinweg nicht ganz konsistent: Manchmal gilt `inplace=True` automatisch, manchmal nicht.

Wir können übrigens auch einzelne Zeilen rauswerfen, basierend auf dem Index der Zeile:

In [152]:
df.drop([2], inplace=True)
df

KeyError: '[2] not found in axis'

Falls wir den Index nicht kennen, suchen wir ihn, und zwar mit dem Attribut `.index`

In [153]:
df[df['Name'] == 'Paul'].index

Int64Index([1], dtype='int64')

In [154]:
df.drop(df[df['Name'] == 'Paul'].index, inplace=True)
df

    Name  Height  Alter  Groesse
0  Peter   180.0     60      NaN

Zu viel gelöscht? Egal, fügen wir die Zeile einfach wieder hinzu, und zwar mit `df.append()`

In [155]:
Paul = pd.Series({'Alter': 44, 'Groesse': 176, 'Name': 'Paul'})

In [156]:
Paul

Alter        44
Groesse     176
Name       Paul
dtype: object

In [158]:
df = df.append(Paul, ignore_index=True)
df

<ipython-input-158-fc58fce0fc63>:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(Paul, ignore_index=True)

    Name  Height  Alter  Groesse
0  Peter   180.0     60      NaN
1   Paul     NaN     44    176.0
2   Paul     NaN     44    176.0

Und zu guter letzt, falls wir doch wieder die Namen als Index wollen: `df.set_index()`

In [159]:
df.set_index('Name', inplace=True)

In [160]:
df

       Height  Alter  Groesse
Name
Peter   180.0     60      NaN
Paul      NaN     44    176.0
Paul      NaN     44    176.0

**Achtung:** Was nicht funktioniert, ist diese Zeile hier: (warum?)

In [ ]:
#df2 = df.set_index('Alter', inplace=True)

**Note:** Die Index-Spalte hat jetzt einen ganz bestimmten Namen: "Name". Wir können diesen Namen auch löschen, und zwar mit `df.rename_axis()`:

In [161]:
df.rename_axis(None, inplace=True)

In [162]:
df

       Height  Alter  Groesse
Peter   180.0     60      NaN
Paul      NaN     44    176.0
Paul      NaN     44    176.0

## Schluss

Es ist nicht wichtig, dass ihr jede dieser Funktionen auswendig könnt und genau wisst, wie man sie anwenden muss, ob inplace=True oder nicht.

Wichtig ist aber:

- Seid euch bewusst, dass es für fast alles, was man mit einem Dataframe anstellen will, in Pandas eine Funktion gibt
- Falls ihr den Namen der gesuchten Funktion nicht kennt: Googelt einfach. Die Chance ist gross, dass ihr schnell fündig werdet
- In der Dokumentation (zB über Google auffindbar: "Pandas set index") steht immer, welche Argumente eine Funktion nimmt
- Sonst einfach ausprobieren. Falls irgendwas komplett falsch läuft, einfach den Kernel nochmals starten und alles nochmal ausführen